YangJR08/Four-switch-Boost-Buck-Power-Supply-Based-on-STM32/mSynchronous-Rectification-Buck-Boost-Digital-Power-Supply-Based-on-STM32-cmake/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ADC_Vin_Pin GPIO_PIN_0
#define ADC_Vin_GPIO_Port GPIOA
#define ADC_Iout_Pin GPIO_PIN_1
#define ADC_Iout_GPIO_Port GPIOA
#define ADC_Vout_Pin GPIO_PIN_2
#define ADC_Vout_GPIO_Port GPIOA
#define ADC_VinA3_Pin GPIO_PIN_3
#define ADC_VinA3_GPIO_Port GPIOA
#define ADC_TEMP_Pin GPIO_PIN_4
#define ADC_TEMP_GPIO_Port GPIOA
#define KEY4_Pin GPIO_PIN_5
#define KEY4_GPIO_Port GPIOA
#define KEY2_Pin GPIO_PIN_6
#define KEY2_GPIO_Port GPIOA
#define KEY3_Pin GPIO_PIN_7
#define KEY3_GPIO_Port GPIOA
#define KEY1_Pin GPIO_PIN_0
#define KEY1_GPIO_Port GPIOB
#define PWM1_H_Pin GPIO_PIN_12
#define PWM1_H_GPIO_Port GPIOB
#define PWM1_L_Pin GPIO_PIN_13
#define PWM1_L_GPIO_Port GPIOB
#define PWM2_H_Pin GPIO_PIN_14
#define PWM2_H_GPIO_Port GPIOB
#define PWM2_L_Pin GPIO_PIN_15
#define PWM2_L_GPIO_Port GPIOB
#define FAN_PWM_Pin GPIO_PIN_8
#define FAN_PWM_GPIO_Port GPIOC
#define I2C3_SDA_Pin GPIO_PIN_9
#define I2C3_SDA_GPIO_Port GPIOC
#define I2C3_SCL_Pin GPIO_PIN_8
#define I2C3_SCL_GPIO_Port GPIOA
#define USART1_TX_Pin GPIO_PIN_9
#define USART1_TX_GPIO_Port GPIOA
#define USART1_RX_Pin GPIO_PIN_10
#define USART1_RX_GPIO_Port GPIOA
#define SP3_SCK_Pin GPIO_PIN_10
#define SP3_SCK_GPIO_Port GPIOC
#define SP3_MISO_Pin GPIO_PIN_11
#define SP3_MISO_GPIO_Port GPIOC
#define SP3_MOSI_Pin GPIO_PIN_12
#define SP3_MOSI_GPIO_Port GPIOC

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
